<template>

    <article data-an="review" id="review">

        <div class="container">

            <div class="headline fx fx-x-between fx-y-start">

                <div class="label-page">отзывы</div>

                <h2 class="headline-title h2">Что говорят наши клиенты</h2>

            </div>


            <div class="slyder" v-touch:swipe.left="nextSlyde" v-touch:swipe.right="prevSlyde">

                <div class="slyde fx fx-content-start" v-for="(item, index) in state.reviews" :key="index" :class="{
                    
                    'active': index == state.slyde, 
                    'prev': index == state.slyde_prev, 
                    'next': index == state.slyde_next, 
                    'sub-prev': index < state.slyde, 
                    'sub-next': index > state.slyde, 
                    
                }">

                    <img :src="item.avatar" width="45" height="45" :alt="`avatar review ${index + 1}`" class="avatar">

                    <strong class="name">{{ item.name }}</strong>

                    <div class="stars fx">

                        <img src="/images/star.svg" width="12" height="12" alt="icon star" class="star" v-for="i in item.star" :key="i">

                    </div>

                    <p class="text text18" v-html="item.text"></p>

                    <p class="date">{{ item.date }}</p>

                </div>

            </div>

            <div class="slyder-actions fx fx-x-center fx-y-center">

                <button class="action-btn prev" @click="prevSlyde"><img src="/images/arrow-dark.svg" width="32" height="32" alt="icon arrow"></button>

                <p class="slyder-page">{{ state.slyde + 1 }}/{{ state.reviews.length }}</p>

                <button class="action-btn next" @click="nextSlyde"><img src="/images/arrow-dark.svg" width="32" height="32" alt="icon arrow"></button>

            </div>

        </div>

    </article>

</template>

<script setup>

    import { reactive, onMounted } from 'vue';

    const state = reactive({

        slyde: 0,
        slyde_prev: 0,
        slyde_next: 0,

        reviews: [

            {
                avatar: '/images/review/avatar-1.png',
                name: 'Андрей Жуков, г. Москва',
                star: 5,
                text: 'Генерация рыбатекста происходит довольно просто: есть несколько фиксированных наборов фраз и словочетаний, из которых в опредёленном порядке формируются предложения. Предложения складываются в абзацы — и вы наслаждетесь очередным бредошедевром.<br/>Сама идея работы генератора заимствована у псевдосоветского "универсального кода речей", из которого мы выдернули используемые в нём словосочетания, запилили приличное количество собственных, в несколько раз усложнили алгоритм, добавив новые схемы сборки, — и оформили в виде быстрого и удобного сервиса для получения тестового контента.',
                date: '22 мая 2024'
            
            },{
                avatar: '/images/review/avatar-1.png',
                name: 'Андрей Жуков, г. Москва',
                star: 5,
                text: 'Генерация рыбатекста происходит довольно просто: есть несколько фиксированных наборов фраз и словочетаний, из которых в опредёленном порядке формируются предложения. Предложения складываются в абзацы — и вы наслаждетесь очередным бредошедевром.<br/>Сама идея работы генератора заимствована у псевдосоветского "универсального кода речей", из которого мы выдернули используемые в нём словосочетания, запилили приличное количество собственных, в несколько раз усложнили алгоритм, добавив новые схемы сборки, — и оформили в виде быстрого и удобного сервиса для получения тестового контента.',
                date: '22 мая 2024'
            
            },{
                avatar: '/images/review/avatar-1.png',
                name: 'Андрей Жуков, г. Москва',
                star: 5,
                text: 'Генерация рыбатекста происходит довольно просто: есть несколько фиксированных наборов фраз и словочетаний, из которых в опредёленном порядке формируются предложения. Предложения складываются в абзацы — и вы наслаждетесь очередным бредошедевром.<br/>Сама идея работы генератора заимствована у псевдосоветского "универсального кода речей", из которого мы выдернули используемые в нём словосочетания, запилили приличное количество собственных, в несколько раз усложнили алгоритм, добавив новые схемы сборки, — и оформили в виде быстрого и удобного сервиса для получения тестового контента.',
                date: '22 мая 2024'
            
            },{
                avatar: '/images/review/avatar-1.png',
                name: 'Андрей Жуков, г. Москва',
                star: 5,
                text: 'Генерация рыбатекста происходит довольно просто: есть несколько фиксированных наборов фраз и словочетаний, из которых в опредёленном порядке формируются предложения. Предложения складываются в абзацы — и вы наслаждетесь очередным бредошедевром.<br/>Сама идея работы генератора заимствована у псевдосоветского "универсального кода речей", из которого мы выдернули используемые в нём словосочетания, запилили приличное количество собственных, в несколько раз усложнили алгоритм, добавив новые схемы сборки, — и оформили в виде быстрого и удобного сервиса для получения тестового контента.',
                date: '22 мая 2024'
            
            },{
                avatar: '/images/review/avatar-1.png',
                name: 'Андрей Жуков, г. Москва',
                star: 5,
                text: 'Генерация рыбатекста происходит довольно просто: есть несколько фиксированных наборов фраз и словочетаний, из которых в опредёленном порядке формируются предложения. Предложения складываются в абзацы — и вы наслаждетесь очередным бредошедевром.<br/>Сама идея работы генератора заимствована у псевдосоветского "универсального кода речей", из которого мы выдернули используемые в нём словосочетания, запилили приличное количество собственных, в несколько раз усложнили алгоритм, добавив новые схемы сборки, — и оформили в виде быстрого и удобного сервиса для получения тестового контента.',
                date: '22 мая 2024'
            
            },{
                avatar: '/images/review/avatar-1.png',
                name: 'Андрей Жуков, г. Москва',
                star: 5,
                text: 'Генерация рыбатекста происходит довольно просто: есть несколько фиксированных наборов фраз и словочетаний, из которых в опредёленном порядке формируются предложения. Предложения складываются в абзацы — и вы наслаждетесь очередным бредошедевром.<br/>Сама идея работы генератора заимствована у псевдосоветского "универсального кода речей", из которого мы выдернули используемые в нём словосочетания, запилили приличное количество собственных, в несколько раз усложнили алгоритм, добавив новые схемы сборки, — и оформили в виде быстрого и удобного сервиса для получения тестового контента.',
                date: '22 мая 2024'
            
            },{
                avatar: '/images/review/avatar-1.png',
                name: 'Андрей Жуков, г. Москва',
                star: 5,
                text: 'Генерация рыбатекста происходит довольно просто: есть несколько фиксированных наборов фраз и словочетаний, из которых в опредёленном порядке формируются предложения. Предложения складываются в абзацы — и вы наслаждетесь очередным бредошедевром.<br/>Сама идея работы генератора заимствована у псевдосоветского "универсального кода речей", из которого мы выдернули используемые в нём словосочетания, запилили приличное количество собственных, в несколько раз усложнили алгоритм, добавив новые схемы сборки, — и оформили в виде быстрого и удобного сервиса для получения тестового контента.',
                date: '22 мая 2024'
            
            },{
                avatar: '/images/review/avatar-1.png',
                name: 'Андрей Жуков, г. Москва',
                star: 5,
                text: 'Генерация рыбатекста происходит довольно просто: есть несколько фиксированных наборов фраз и словочетаний, из которых в опредёленном порядке формируются предложения. Предложения складываются в абзацы — и вы наслаждетесь очередным бредошедевром.<br/>Сама идея работы генератора заимствована у псевдосоветского "универсального кода речей", из которого мы выдернули используемые в нём словосочетания, запилили приличное количество собственных, в несколько раз усложнили алгоритм, добавив новые схемы сборки, — и оформили в виде быстрого и удобного сервиса для получения тестового контента.',
                date: '22 мая 2024'
            
            },

        ],

    });

    const calcSlyde = () => {

        state.slyde_prev = state.reviews[state.slyde - 1] ? state.slyde - 1 : 0;
        state.slyde_next = state.reviews[state.slyde + 1] ? state.slyde + 1 : 0;

    };

    const prevSlyde = () => {

        state.slyde = state.reviews[state.slyde - 1] ? state.slyde - 1 : state.reviews.length - 1;
        calcSlyde();

    };

    const nextSlyde = () => {

        state.slyde = state.reviews[state.slyde + 1] ? state.slyde + 1 : 0;
        calcSlyde();

    };

    const openSlyde = (i) => {

        state.slyde = i;
        calcSlyde();

    };

    onMounted(() => {

        openSlyde(0);

    });

</script>